{"class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "Embedding", "config": {"dtype": "int32", "name": "embedding_1", "trainable": true, "output_dim": 32, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 500], "embeddings_constraint": null, "input_length": 500, "activity_regularizer": null, "input_dim": 8000, "mask_zero": false}}, {"class_name": "Conv1D", "config": {"use_bias": true, "padding": "same", "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "bias_regularizer": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "dilation_rate": [1], "bias_constraint": null, "strides": [1], "kernel_regularizer": null, "kernel_size": [3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "padding": "valid", "trainable": true, "strides": [2], "pool_size": [2]}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "use_bias": true, "implementation": 0, "trainable": true, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 100, "name": "lstm_1", "return_sequences": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 2, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null}}], "backend": "tensorflow"}